#include <stdio.h>

int main() {
    int x, sum = 0; // оголошення змінних для введення користувачем та суми
    printf("Введіть ціле число x: "); // запит на введення числа
    scanf("%d", &x); // зчитування введеного числа

    for (int i = 10; i <= 100; i++) { // цикл для перебору чисел від 10 до 100 
        if (i % 2 == 0 && i > x) // перевірка на парність і більше за x
            sum += i; // додавання до суми
    }

    printf("Сума парних чисел більше за %d у діапазоні [10;100]: %d\n", x, sum);
    return 0;
}
