#include <stdio.h>
#include <math.h>

int main() {
    float a = -1.0;    // Початок інтервалу
    float b = 3.0;     // Кінець інтервалу
    float dx = 0.25;   // Збільшений крок для зменшення кількості рядків
    float x = a; // Початкове значення x
    float y; // Змінна для зберігання значення функції

    printf("\n==============================\n");
    printf("   x\t\t  y = log10(x)/x\n");
    printf("==============================\n");

    while (x <= b) { // Цикл для перебору значень x від a до b з кроком dx
        if (x <= 0) {// Перевірка на невизначеність логарифма 
            printf("%6.2f\t\t  невизначено\n", x); //   виведення повідомлення про невизначеність
        } else { // Якщо x більше 0, обчислюємо y
            y = log10(x) / x; // Обчислення значення функції y = log10(x)/x
            printf("%6.2f\t\t  %.6f\n", x, y);
        }
        x += dx; // Збільшення x на dx для переходу до наступного значення
    }

    printf("==============================\n");
    return 0;
}
